{"meta":{
    "characters":["MRS. MOLLOY", "CORNELIUS", "MINNIE", "BARNABY", "DOLLY"],
    "name":"Act 1 Scene 5",
    "location":"The Hat Shop"
},
"lines":
[
    {"speaker":"MRS. MOLLOY", "text":"Oh, Minnie, we'll get an adventure out of this yet!"},
    {"speaker":"Stage Directions", "text":"MRS. MOLLOY exits. BARNABY and CORNELIUS enter."},
    {"speaker":"CORNELIUS", "text":"We'll get an adventure out of this yet, Barnaby! All day long we wander around New York and nothing happens, then we come to the quietest street in the city and suddenly..."},
{"speaker":"BARNABY", "text":"Vandergelder!"},
{"speaker":"CORNELIUS", "text":"Is he still out there? Go look."},
{"speaker":"BARNABY", "text":"He's sitting on that bench. Cornelius, are you sure this is an daventure?"},
{"speaker":"CORNELIUS", "text":"You don't have to ask, Barnaby. When you're in one you'll know it alright! How much money have you got left?"},
{"speaker":"BARNABY", "text":"Not much, Cornelius. Forty cents for the train back, thirty cents for dinner, and twenty cents to see the whale. Ninety cents. Why?"},
{"speaker":"CORNELIUS", "text":"When those women come out we'll have to pretend to be customers. Customers! That's it! Maybe the best thing to do is make them think we're rich. Then we won't have to spend anything! We're two men about town looking for hats for ladies. Good afternoon, Mrs. --"},
{"speaker":"Stage Directions", "text":"MRS. MOLLOY enters."},
{"speaker":"MRS. MOLLOY", "text":"Molloy"},
{"speaker":"CORNELIUS", "text":"Here, Cornelius Hackl!"},
{"speaker":"BARNABY", "text":"Here, Barnaby Tucker!"},
{"speaker":"MRS. MOLLOY", "text":"My pleasure, gentlemen. Now what can I do for you, hmm?"},
{"speaker":"CORNELIUS", "text":"Well, you see, we're two ladies about town looking for some hats to Molloy and we wondered..."},
{"speaker":"BARNABY", "text":"We're hats, you see and we wanted to buy a lady or two to Molloy with..."},
{"speaker":"CORNELIUS", "text":"we want a hat! For a lady, of course. And everybody said to go to Mrs. Malloy's because she is so pretty… I mean her hats are so pretty."},
{"speaker":"BARNABY", "text":"And so reasonable, Cornelius! As reasonable, as under a dollar, would still leave us enough to see the whale."},
{"speaker":"CORNELIUS", "text":"You've got to pay him no mind, ma'am. He's come all the way from Yonkers to see the stuffed whale and he's all excited. Just keep an eye on that street, Barnaby, and maybe you'll see a pass by."},
{"speaker":"BARNABY", "text":"is it big and black with me and little red eyes?"},
{"speaker":"CORNELIUS", "text":"Yes."},
{"speaker":"BARNABY", "text":"it's sitting right on that bench."},
{"speaker":"MRS. MOLLOY", "text":"excuse me, but did you say Yonkers, Mr. Hackl?"},
{"speaker":"CORNELIUS", "text":"Oh yes, ma'am, Yonkers! And forgive me for saying this but you really should see Yonkers. By that I mean perhaps Mr. Molloy would like to see Yonkers, too!"},
{"speaker":"MRS. MOLLOY", "text":"Oh, I'm a widow, Mr. Hackl."},
{"speaker":"CORNELIUS", "text":"You are? Barnaby, she's a widow! Oh, that's too bad. I'm sure Mr. Molloy would have enjoyed Yonkers. Especially in that hat. I mean on you of course not Mr Molloy may he rest in peace, you're Catholic aren't you, we'll don't let that worry you I'd be willing to change-- Mrs. Molloy, if you should ever happen to have a Sunday free in the near future, I'd be more than pleased to show you Yonkers from top to bottom!"},
{"speaker":"MRS. MOLLOY", "text":"Well As a matter of fact, Mr. Hackl, I might be there sooner than you think."},
{"speaker":"CORNELIUS", "text":"oh, really?"},
{"speaker":"MRS. MOLLOY", "text":"You see, I have a friend who lives in Yonkers."},
{"speaker":"CORNELIUS", "text":"Do you?"},
{"speaker":"MRS. MOLLOY", "text":"Perhaps you know him..."},
{"speaker":"CORNELIUS", "text":"Perhaps we do."},
{"speaker":"MRS. MOLLOY", "text":"oh, it's always foolish to ask in cases like that, isn't it? It's a Mr. Vander Gelder."},
{"speaker":"CORNELIUS", "text":"Horace Vandergelder?"},
{"speaker":"BARNABY", "text":"Of Vandergelder's Hay and Feed?"},
{"speaker":"MRS. MOLLOY", "text":"Do you knwo him?"},
{"speaker":"CORNELIUS", "text":"Oh, no no."},
{"speaker":"MRS. MOLLOY", "text":"Mr. Vandergelder's a substantial man and well liked, they tell me."},
{"speaker":"CORNELIUS", "text":"he's a lovely man, Mrs. Molloy. Just lovely! Has only one fault as far as I know; he's hard as nails."},
{"speaker":"BARNABY", "text":"Cornelius, I think... I think..."},
{"speaker":"MRS. MOLLOY", "text":"Now, I wonder if your friend might like this one!"},
{"speaker":"BARNABY", "text":"Look out!"},
{"speaker":"CORNELIUS", "text":"Begging your pardon, Mrs. Molloy --"},
{"speaker":"MRS. MOLLOY", "text":"Gentlemen! What are you doing?"},
{"speaker":"CORNELIUS", "text":"Help us, Mrs. Molloy! We'll explain later."}
]
}